run/synthTopoWedge/0/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2557
(
0.45
0.9999999999
0.9999999999
0.9999999999
0.9999999999
0.9999999999
0.9999999999
0.9999999999
...
)
;

boundaryField
{
    atm
    {
        type            inletOutlet;
        inletValue      uniform 0.9999999999;
        value           uniform 0.9999999999;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.9999999999;
        value           uniform 0.9999999999;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
