run/synthTopoWedge/0/ph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -1 -2 0 0 0 0];

internalField       uniform 76631.0;

boundaryField
{
    terrain
    {
        type               zeroGradient;
    }
    atm
    {
        type               zeroGradient;
    }
    top
    {
        type               fixedValue;
        value              uniform 76631.0;
    }
    crater
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            wedge;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
