run/synthTopoWedge/0/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2557
(
86848.0068269
86843.1820612
86836.5722153
86827.9485983
86818.1501563
86805.245712
86792.0485703
86777.2750222
...
)
;

boundaryField
{
    atm
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
39
(
1.01760410972e-09
5.4955877637e-10
1.97887303371e-10
6.81867028721e-11
2.43549842579e-11
8.59486326201e-12
0
0
...
)
;
        value           nonuniform List<scalar> 
39
(
86756.7575589
86738.4871068
86718.6856904
86697.3671401
86674.5451988
86650.2335339
86624.4457369
86597.1953191
...
)
;
    }
    top
    {
        type            fixedValue;
        value           uniform 86225.8736324;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    terrain
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
138
(
0.111203297528
0.111204143456
0.111204567201
0.111204577379
0.111204583474
0.111204583599
0.111204583248
0.11120458311
...
)
;
        value           nonuniform List<scalar> 
138
(
86846.8598196
86846.8598122
86846.85927
86846.8590421
86846.8583898
86846.8582004
86846.8577346
86846.8576105
...
)
;
    }
}


// ************************************************************************* //
