run/synthTopoWedge/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (particles gas);

continuousPhase gas;

pMin 10000;

particles
{
    type          purePhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1e-4;
    }

    alphaMax        0.67;
    residualAlpha   1e-6;
}

gas
{
    type          multiComponentPhaseModel; //purePhaseModel;
    diameterModel none;

    residualAlpha   1e-06;
}

blending
{
    default
    {
        type            continuous;
        phase gas;
    }
}

surfaceTension
{
    particles_gas
    {
        type            constant;
        sigma           0;
    }
}


drag
{
    particles_dispersedIn_gas
    {
        type timeScaleFiltered;
        minRelaxTime 1e-5;
   
        dragModel 
        {
            type            GidaspowErgunWenYu;
            residualRe      1e-3;
        }
    }
}

virtualMass
{
    particles_dispersedIn_gas
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    particles_dispersedIn_gas
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

interfaceCompression
{}

// ************************************************************************* //
